package Easy;

public class Questions {

    /*

    1. Типы тестирования - Unit тестирование, интеграционное тестирование, GUI- тесты.
    2. Различие между unit-тестированием и интеграционным тестированием в том, что
        1-е тестирует отдельные методы и функции классов приложения, каждый компонент отдельно.
        А 2-й тестирует уже, тестирует отдельные полноценные модули и компоненты приложения.
    3. Библиотеки JUnit, SpringTest.
    4. @BeforeClass/@AfterClass - помечает метод, который вызывается и
        что-то делает до/после использования класса, соответственно.
        @Ignore - помечает тестовый метод и он не будет вызываться в тестах.
        @Before/@After - помечает метод, который вызывается и
        что-то делает до/после тестового метода, соответственно.
        @Mock - помечает заглушку-класс.
        @InjectMocks - внедряет заглушку.
    5. Mock - это просто пустышка, вообще ничего не умеет и не делает.
        Spy - настоящий объект, которому можно настроить собственное поведение.
    6. В библиотеке Mockito существуют метод verify - который проверяет, а действительно ли
        объект сделал то о чём его попросили. verifyNoMoreInteractions - проверяет,
        не делал ли объект лишних вещей.

     */

}
